{
    "contentServerUrl": "http://localhost:3000",
    "dummyDiagramEnabled": false,
    "dispatcherUrl": "/#/editor/Template_Module_1x2",
    "showStats": false,
    "showBuildHash": false,

    "designsToSelect": [
        {

            "id": "featured-designs",
            "label": "Featured Projects",
            "designs": [

                {
                    "name": "Bluetooth System",
                    "description": "This model is a template that can be used to make a fully functional Bluetooth device. Just add your desired subcircuit(s) to the model and hook it up to the provided ports to allow for the sending and receiving of sensor data using Cypress' PSoC® 4 BLE technology after connecting it to a BLE motherboard.",
                    "visual": "images/bluetooth_icon300x300.png",
                    "noComponentBrowser": true,
                    "noAutoRouter": true,
                    "tutorial": {
                        "intro": "In this tutorial you'll be able to quickly generate a circuit board that will allow subcircuit data to be sent and received wirelessly.",
                        "steps": [
                            {
                                "description": "Grab a sensor from the <b>SUBCIRCUITS</b> panel and drag it onto the canvas.",
                                "visual": "images/add_sc_bluetooth.png"
                            },
                            {
                                "description": "Connect the subcircuit's power ports and communication interfaces to the corresponding interfaces on the <b>Bluetooth Daughtercard</b>. When you begin to create a wire by selecting a port, other similarly labeled ports in the design will remain highlighted.",
                                "visual": "images/connect_stuff_bluetooth.png"
                            },
                            {
                                "description": "Click the <b><i>play</i></b> button to automatically generate a <b>PCB</b> <i>(printed circuit board)</i>. This can take a few minutes depending on the number of subcircuits in your design.",
                                "visual": "images/click_play_bluetooth.png"
                            },
                            {
                                "description": "After reviewing the results, iterate on your design by making changes, adding more subcircuits, and generating new PCBs.",
                                "visual": "images/show_results_bluetooth.png"
                            }
                        ],
                        "outro": "A completed Bluetooth Daughtercard + subcircuit design could then be sent to manufacturing to build the PCB. Connect the manufactured device to a Cypress BLE Motherboard and watch your sensor's data being transmitted over a bluetooth connection!"
                    }
                },
                {
                    "name": "Arduino DUE Shield Basic",
                    "description": "This model represents a limited-featured Arduino shield, which connects to your Arduino to extend its capabilities.  Simply add your subcircuit(s) and hook it up to the shield's exposed ports. It is a great starting point for less experienced Arduino users as it hides some of the more advanced connectors. The shield is a separate component that pairs well with an Arduino DUE.",
                    "visual": "images/arduino_due_shield.png",
                    "noComponentBrowser": true,
                    "noAutoRouter": true,
                    "tutorial": {
                        "intro": "In this tutorial you'll be able to quickly generate a circuit board that can extend the capabilities of an Arduino DUE by connecting a subcircuit to an Arduino Shield. This basic version of the shield only has the 3V3 Power/Ground port exposed, so only 3V3 Power/Ground subcircuits are compatible.",
                        "steps": [
                            {
                                "description": "Grab a sensor from the <b>SUBCIRCUITS</b> panel and drag it onto the canvas. Check the subcircuit's properties to ensure that your desired subcircuit has a <b>Power/Ground</b> port that is compatible with the Basic Shield.",
                                "visual": "images/add_sc_arduino_basic.png"
                            },
                            {
                                "description": "Connect the subcircuit's power ports to the interface on the <b>Arduino Interface</b>, and the Analog/Digital communication interfaces to the corresponding interfaces on either the <b>Analog Breakout</b> or <b>GPIO Breakout</b>, respectively. When you begin to create a wire by selecting a port, other similarly labeled ports in the design will remain highlighted.",
                                "visual": "images/connect_stuff_arduino_basic.png"
                            },
                            {
                                "description": "Click the <b><i>play</i></b> button to automatically generate a <b>PCB</b> <i>(printed circuit board)</i>. This can take a few minutes depending on the number of subcircuits in your design.",
                                "visual": "images/click_play_arduino_basic.png"
                            },
                            {
                                "description": "After reviewing the results, iterate on your design by making changes, adding more subcircuits, and generating new PCBs.",
                                "visual": "images/show_results_arduino_basic.png"
                            }
                        ],
                        "outro": "A manufactured design of the shield + subcircuit could then be connected to an Arduino DUE, allowing you to add any number of features to your Arduino!"
                    }

                },
                {
                    "name": "Arduino DUE Shield Advanced",
                    "description": "This design extends the Arduino Shield Basic project by exposing the full functionality of the Arduino to allow you to hook up more complex systems. The template adds 5 connectors, as well as 5V Power/Ground, IOREF, AREF, and Vin pins. It is intended for more experienced users. Similar to the basic project, this shield is a separate component from an Arduino.",
                    "visual": "images/arduino_due_shield.png",
                    "noComponentBrowser": true,
                    "noAutoRouter": true,
                    "tutorial": {
                        "intro": "In this tutorial you'll be able to quickly generate a circuit board that can extend the capabilities of an Arduino by connecting a subcircuit to an Arduino Shield. This advanced version of the shield exposes all ports and functionality featured by the Arduino Shield. As such, it is compatible with subcircuits using either 3V3 and 5V Power/Ground connectors.",
                        "steps": [
                            {
                                "description": "Grab a sensor from the <b>SUBCIRCUITS</b> panel and drag it onto the canvas.",
                                "visual": "images/add_sc_arduino_adv.png"
                            },
                            {
                                "description": "Connect the subcircuit's power ports to the interface on the <b>Arduino Interface</b>. Then connect any Analog communication interfaces to the corresponding interfaces on the <b>Analog Breakout</b>. In addition to the <b>GPIO Breakout</b> provided with the Arduino Shield Basic, digital subcircuit communication interfaces can be connected to any ports in the <b>HID Breakout</b>. When you begin to create a wire by selecting a port, other similarly labeled ports in the design will remain highlighted.",
                                "visual": "images/connect_stuff_arduino_adv.png"
                            },
                            {
                                "description": "Click the <b><i>play</i></b> button to automatically generate a <b>PCB</b> <i>(printed circuit board)</i>. This can take a few minutes depending on the number of subcircuits in your design.",
                                "visual": "images/click_play_arduino_adv.png"
                            },
                            {
                                "description": "After reviewing the results, iterate on your design by making changes, adding more subcircuits, and generating new PCBs.",
                                "visual": "images/show_results_arduino_adv.png"
                            }
                        ],
                        "outro": "Since this shield has both a 3V3 and 5V Power/Ground port, a manufactured PCB of this model should be compatible with any standard Arduino, giving you even more freedom in designing!"
                    }
                },
                {
                    "name": "Photon Shield Template",
                    "description": "This template allows you to connect to Particle’s WiFi Photon device. The Photon is a tiny Wi-Fi development kit for creating connected projects and products for the Internet of Things.The board uses a Broadcom Wi-Fi chip alongside a powerful ARM Cortex M3 micro controller. It has a 3.3VDC SMP power supply, RF and user interface components on a small single-sided PCB.",
                    "visual": "images/photon_wifi.png",
                    "noComponentBrowser": true,
                    "noAutoRouter": true
                },
                {
                    "name": "Electric Imp Module",
                    "description": "The Electric Imp platform has an imp, a module containing WiFi and a processor to connect to the Internet or work as an independent device. It features fully integrated hardware, software, OS, APIs, cloud services and security. This version follows the Nora hardware reference design, a sensor node powered by two AA lithium battery cells.",
                    "visual": "images/electric_imp.png",
                    "noComponentBrowser": true,
                    "noAutoRouter": true
                }

            ]

        },

        {

            "id": "experimental",
            "label": "Experimental Projects",
            "designs": [

                {
                    "name": "Template Module 1x2",
                    "isExperimental": true,
                    "description": "This model is in the ARA 1x2 form factor. All of the boilerplate needed to link your module to the Endo is provided. Simply hook your customizations up to the provided protocol ports and power lines.",
                    "visual": "images/ara-design.png"
                },
                {
                    "name": "EKG USB Device",
                    "isExperimental": true,
                    "description": "This USB device is designed to be used for electrocardiograms (EKG). Electrodes plug into the device, and a computer or mobile device connects via the USB port.",
                    "visual": "images/heart-rate-monitor.png"
                }

            ]

        }

    ]
}
